[{"id":"37Vow0HxyQR6MOMBiOA_g","title":"Hello","body":"Test Test Test","votes":-1,"creation_date":"2024-07-14T19:31:59.636Z"},{"id":"zhGgU7zaDw0BPYovCrx1Q","title":"New Post","body":"This is the New Post Description ","votes":-2,"creation_date":"2024-07-14T19:32:32.249Z"},{"id":"qVNEKepl_lbexA3gII0aN","title":"New Post","body":"Hello tailwind","votes":-6,"creation_date":"2024-07-14T20:10:16.848Z"},{"id":"xw7hKtWl5gY4G0SDxTwt6","title":"new Post","body":"hello 2 2 23232","votes":-1,"creation_date":"2024-07-14T20:40:42.611Z"},{"id":"6iWE5InXfPbuNPekhVZiR","title":"THE BLACK ECONOMIC ALLIANCE FOUNDATION ANNOUNCES NEW COLLABORATION WITH DELOITTE","body":"“We are in a defining moment for the future prosperity of Black Americans and our economy as a whole,” said Samantha Tweedy, President, Black Economic Alliance Foundation. “The Black Economic Alliance Foundation is advancing a new, more equitable economic infrastructure and we are grateful to Deloitte for its resources to support our efforts. This collaboration with Deloitte will help us develop meaningful investment and philanthropic programs, lead impactful research, and elevate understanding of the inextricable link between the health of the Black economy and the entire American economy.” \n\n“The unique ability of the Black Economic Alliance Foundation to harness the collective expertise and influence of Black business leaders to develop generational wealth-building opportunities for the Black community has become a model for economic development,” said Kwasi Mitchell, Chief Purpose Officer at Deloitte. “Together, we will facilitate actionable solutions that can help reshape the future for Black Americans. A truly equitable society is more than just an ideology, it’s a reality that we believe we can help achieve through our collaboration with organizations like the BEA Foundation to turn vision into action for generations to come.”\n\n","votes":16,"creation_date":"2024-07-14T20:44:11.208Z"},{"id":"fq_YoF9_zooGxxSWNcxbH","title":"After Trump assassination attempt, a reckoning over American political rhetoric","body":"The FBI is investigating the shooting as an act of domestic terrorism, but has not identified a motive for the incident that wounded Trump and killed a spectator.\n\nBy Minyvonne Burke, Alex Seitz-Wald and Megan Lebowitz\nBUTLER, Pa. — A day after the shocking assassination attempt on former President Donald Trump at a campaign rally in Pennsylvania, the nation is left wondering whether the political polarization that has gripped the country has grown too severe.\n\nCondolences and calls to turn down the rhetorical heat poured in from across the country and the world as leaders of all political stripes expressed shock and horror at the first shooting of a U.S. president since Ronald Reagan was nearly killed more than 40 years ago while leaving a hotel in Washington.\n\n“We’re all Americans, and we have to treat one another with dignity and respect,” House Speaker Mike Johnson said in an interview Sunday on NBC News’ “Weekend Today.” He went on to echo the blame that Trump allies are placing on President Joe Biden, who used the word “bull’s-eye” on a campaign call with donors last week.\n\n“I mean, I know that he didn’t mean what is being implied there,” Johnson said Sunday about Biden’s comments, but added, “That kind of language on either side should be called out.”\n\nViolence tends to beget more violence and experts fear the shooting will inflame, rather than calm, tensions heading into a presidential campaign whose stakes are seen as existential by both sides.\n\n“This is a very dark moment in our history, and unfortunately this is very unlikely to be the end of political violence this election season,” said Jacob Ware, a research fellow at the Council on Foreign Relations who studies domestic and international terrorism. “A whole range of scenarios, from low-level vigilante violence to higher-profile assassination attempts, will likely characterize the next several months.”\n\nOnce violence becomes seen as a legitimate avenue to settle political scores, \"it’s difficult to know how to reverse that development,\" Ware added.\n\nViolent rhetoric has become a more familiar part of political campaigns in recent years, as has sometimes violent clashes between protesters, counter-protesters and police. But assassinations have not been seen in American politics for decades.\n\nTrump, who was hit in the ear by a bullet, was released from the hospital Saturday night, while two spectators who were seriously injured remain hospitalized. Another spectator was killed.\n\nThe two injured rally attendees are in stable condition, according to the Pennsylvania State Police.","votes":22,"creation_date":"2024-07-14T20:45:00.738Z"}]